In [4]:
import pandas as pd

DATA_PATH = './data/[Dataset]BigData_Type02/'
X_TRAIN_DATA_NAME = 'X_train.csv'
X_TEST_DATA_NAME = 'X_test.csv'
Y_TRAIN_DATA_NAME = 'y_train.csv'

In [10]:
# load datasets 
X_train = pd.read_csv(DATA_PATH + X_TRAIN_DATA_NAME, index_col=0, encoding='cp949')
X_test = pd.read_csv(DATA_PATH + X_TEST_DATA_NAME, index_col=0, encoding='cp949')
y_train = pd.read_csv(DATA_PATH + Y_TRAIN_DATA_NAME, index_col=0, encoding='cp949')

X_train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3500 entries, 0 to 3499
Data columns (total 9 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   총구매액     3500 non-null   int64
 1   최대구매액    3500 non-null   int64
 2   환불금액     1205 non-null   float64
 3   주구매상품    3500 non-null   object
 4   주구매지점    3500 non-null   object
 5   내점일수     3500 non-null   int64
 6   내점당구매건수  3500 non-null   float64
 7   주말방문비율   3500 non-null   float64
 8   구매주기     3500 non-null   int64
dtypes: float64(3), int64(4), object(2)
memory usage: 273.4+ KB

In [11]:
X_train.head(3)

,총구매액,최대구매액,환불금액,주구매상품,주구매지점,내점일수,내점당구매건수,주말방문비율,구매주기
cust_id,,,,,,,,,
0,68282840,11264000,6860000.0,기타,강남점,19,3.894737,0.527027,17
1,2136000,2136000,300000.0,스포츠,잠실점,2,1.500000,0.000000,1
2,3197000,1639000,NaN,남성 캐주얼,관악점,2,2.000000,0.000000,1

In [12]:
y_train.head(3)

         gender
cust_id
0             0
1             0
2             1